[
  "Pay yourself first: automate a transfer to savings on payday.",
  "Keep an emergency fund of 3–6 months of expenses.",
  "Track every expense for 30 days to spot leaks.",
  "Give every shekel a job with a zero-based budget.",
  "Negotiate recurring bills once a year (internet, phone, insurance).",
  "Cancel subscriptions you haven’t used in the last 60 days.",
  "Review bank fees and ask for waivers.",
  "Increase savings rate 1% each quarter.",
  "Use separate accounts for spending and bills.",
  "Set a realistic yearly savings goal and review monthly.",
  "Build a sinking fund for irregular expenses (car, gifts, repairs).",
  "Meal plan to cut food waste and impulse orders.",
  "Buy generic for staples; brand where quality matters.",
  "Sleep on purchases over 300₪ for 24 hours.",
  "Unsubscribe from marketing emails to reduce temptation.",
  "Use price trackers for big purchases.",
  "Bundle errands to save time and fuel.",
  "Maintain your stuff—repairs are cheaper than replacements.",
  "Compare total cost of ownership, not sticker price.",
  "Pay high‑interest debt first (avalanche method).",
  "Make at least the minimum on every debt, on time.",
  "Avoid carrying credit card balances.",
  "Refinance high‑interest loans if rates improve.",
  "Don’t cosign loans you can’t afford to repay.",
  "Automate debt payments right after payday.",
  "Snowball small balances for quick wins if you need motivation.",
  "Build credit with on‑time payments and low utilization (<30%).",
  "Check your credit report annually for errors.",
  "Keep old credit lines open to lengthen credit history.",
  "Avoid opening several new accounts at once.",
  "Invest early; time in market beats timing the market.",
  "Use low‑cost index funds for broad diversification.",
  "Know your risk tolerance before choosing asset allocation.",
  "Rebalance your portfolio annually.",
  "Keep investing simple; avoid products you don’t understand.",
  "Beware of high fees—they quietly erode returns.",
  "Dollar‑cost average to reduce timing risk.",
  "Max out tax‑advantaged accounts first (if available).",
  "Do not chase last year’s top performer.",
  "Separate long‑term investments from short‑term cash needs.",
  "Hold at least 5–10 years for stock investments.",
  "Keep crypto/speculation to a small, capped % of your net worth.",
  "Diversify across asset classes and regions.",
  "Know the difference between volatility and risk.",
  "Insurance is for catastrophes, not conveniences.",
  "Maintain adequate health, life, disability, and third‑party car insurance.",
  "Raise deductibles to lower premiums—only if your emergency fund can handle it.",
  "Shop insurance annually; loyalty rarely wins on price.",
  "Document valuables for claims and keep records backed up.",
  "Review beneficiaries after major life events.",
  "Understand tax brackets—marginal vs. effective rate.",
  "Harvest tax losses where legal to offset gains.",
  "Keep receipts for deductions and credits.",
  "Use separate folders for taxes: income, expenses, investments.",
  "Contribute early in the year to tax‑advantaged accounts.",
  "Avoid short‑term gains when a long‑term tax rate is better.",
  "Track cost basis for each investment.",
  "If self‑employed, set aside taxes from each payment.",
  "Refinance mortgages only if total savings exceed total costs.",
  "Avoid extending the term unless cash flow is critical.",
  "Make one extra principal payment per year to cut interest.",
  "Keep housing costs (all‑in) under ~30% of take‑home pay.",
  "Compare fixed vs. variable rate with stress testing.",
  "Don’t drain emergency funds to make extra mortgage payments.",
  "Price per use: buy quality for items you use daily.",
  "Use the 50/30/20 or similar rule as a starting framework.",
  "Automate good behavior; remove friction from bad behavior.",
  "Review your budget on the same day every week.",
  "Set calendar reminders for all financial deadlines.",
  "Name your goals (e.g., “Greece 2026”) to stay motivated.",
  "Track net worth quarterly to see progress.",
  "Focus on big rocks: housing, transport, food, taxes, insurance.",
  "Say no gracefully: “Not in the budget this month.”",
  "Avoid lifestyle creep when income rises.",
  "Invest in skills that raise your earning power.",
  "Monetize hobbies carefully—don’t kill the joy.",
  "Use windfalls (bonuses, refunds) to boost goals, not lifestyle.",
  "Create a ‘fun money’ line to prevent burnout.",
  "Batch buy non‑perishables on sale; avoid stockpiling perishables.",
  "Use cash or a prepaid card for categories you overspend.",
  "Keep financial documents organized and backed up.",
  "Set up account alerts for low balances and large transactions.",
  "Enable two‑factor authentication everywhere.",
  "Never share one‑time codes or passwords.",
  "Freeze your credit if you suspect identity theft.",
  "Review permissions of finance apps yearly.",
  "Avoid public Wi‑Fi for banking; use a VPN if needed.",
  "Discuss money with your partner monthly—same page, fewer fights.",
  "Define shared goals and individual allowances.",
  "Align investments with time horizon and purpose.",
  "Don’t compare your Chapter 1 to someone’s Chapter 20.",
  "Beware of FOMO—social media is a highlight reel.",
  "If a deal sounds too good to be true, it is.",
  "Write an investment policy statement to guide decisions.",
  "Use checklists for big financial choices.",
  "Keep a “wait list” for wants; revisit in 30 days.",
  "Estimate purchases in hours of work, not just price.",
  "Plan for irregular income with a base budget.",
  "Set guardrails: min savings %, max dining budget, etc.",
  "Review and update beneficiaries and wills regularly.",
  "Create a simple estate plan and organize passwords.",
  "Practice gratitude; contentment is a financial skill.",
  "Remember: consistency beats intensity over the long run."
]
